[
    {
        "title": "Frenulum Stretching",
        "stretchInfo": "The frenulum is a small band connecting your glans to the inner foreskin surface. Some men with phimosis often have a slightly shorter frenulum which can be stretched using the method shown.",
        "warning": "The frenulum is one of the most sensitive areas of your penis, so take care whilst performing this stretch.",
        "image": "frenulum-stretching",
        "steps": "1. Grab the lower part of your foreskin using your thumb and index finger. \n \n2. Gently pull the lower foreskin forward. This pulls your frenulum forward as well. \n \n3. Pull the frenulum forward for x number of seconds and then relax",
        "closingText": "Avoid pulling the foreskin over the head by using extreme force because this could cause injuries. \n \nFrenulum stretching is only for loosening up your frenulum and will not solve your phimosis by itself. You will need to perform the other stretches to loosen up your phimotic band diameter.",
        "references": ["https://www.wikihow.fitness/Do-Phimosis-Stretching", "https://www.phimostretch.com/blogs/news/phimosis-stretching-guide", "https://www.pristyncare.com/blog/phimosis-stretching-exercises/"]
    },
    {
        "title": "2 Finger Side Stretching",
        "stretchInfo": "If you cannot insert two fingers in the tip of your foreskin, you will not be able to perform manual stretching properly. In this case, you will need to perform 2 fingers stretching from the side of the penis so that you can begin to widen the gap.",
        "warning": "Only stretch the skin as far as is comfortable, you should not feel any pain whilst performing this stretch.",
        "image": "two-finger-side-stretching",
        "steps": "1. Locate your phimotic band by retracting your foreskin slightly. \n \n2. Grab the opposite sides of the phimotic band as shown using your thumb and index finger of each hand. \n \n3. Stretch it gently by pulling in the opposite direction.",
        "closingText": "This stretch is only necessary for those who cannot insert 2 fingers into their foreskin. Once you are able to insert both fingers into the foreskin, follow the 2 finger insertion method.",
        "references": ["https://www.wikihow.fitness/Do-Phimosis-Stretching", "https://www.phimostretch.com/blogs/news/phimosis-stretching-guide", "https://www.pristyncare.com/blog/phimosis-stretching-exercises/"]
    },
    {
        "title": "2 Finger Stretching Inside the Phimotic Band",
        "stretchInfo": "Once you can fit your fingers inside the foreskin, you are close to having your foreskin stretched an appropriate amount! \n \nTo perform 2 fingers stretching inside the phimotic band, you should be able to insert two fingers inside your phimotic band. If you cannot do so, you should first perform the 2 Finger Side Stretching exercise as described here.",
        "warning": "Always wash your hands before performing this stretch, otherwise, you may cause an infection. \n \nOnly stretch the skin as far as is comfortable, you should not feel any pain whilst performing this stretch.",
        "image": "two-finger-inside-stretching",
        "steps": "1. Place your two fingers back-to-back inside the foreskin \n \n2. Locate your phimotic band. (It should feel like a small inelastic rubber band) \n \n3. Press the backs of your fingers against one another and gently stretch the skin by pushing in opposite directions.",
        "closingText": "You can use any two fingers for this exercise, however, as you progress you should begin to use larger fingers as the foreskin gets wider. \n \nThis exercise is the most important exercise in the stretching process as it begins to widen the phimotic band enabling the foreskin to begin retracting over the head of the penis. \n \nThis method is safe because you will be able to feel the limits you can stretch your phimotic band without causing tears.",
        "references": ["https://www.wikihow.fitness/Do-Phimosis-Stretching", "https://www.phimostretch.com/blogs/news/phimosis-stretching-guide", "https://www.pristyncare.com/blog/phimosis-stretching-exercises/"]
    },
    {
        "title": "Pulling the foreskin back and forth",
        "stretchInfo": "You can try to pull back your foreskin with either a flaccid or erect penis, however, never force the skin to retract any further than your phimotic band allows; you will feel when you have reached your limit. \n \nAs you continue to stretch the foreskin, slowly the phimotic band will enable you to pull back the foreskin further.",
        "warning": "Only pull the skin as far as the phimotic band allows, any further can cause tears.",
        "image": "retracting-foreskin",
        "steps": "The correct way to do it is by lying on your back and using your fist or fingers to make an up and down stroke. You may find this stretch easier to do during a shower warm water makes the skin looser.",
        "closingText": "Normally your foreskin will retract fully and then move forward, resulting in a gliding motion of the foreskin over the glans. However, due to the phimotic band, the motion is restricted up to the extent your phimotic band opening allows.",
        "references": ["https://www.wikihow.fitness/Do-Phimosis-Stretching", "https://www.phimostretch.com/blogs/news/phimosis-stretching-guide", "https://www.pristyncare.com/blog/phimosis-stretching-exercises/"]
    }
]
