{
    "title": "Understanding Phimosis",
    "introduction": "Phimosis is a condition that stops the foreskin from retracting over the head of the penis. It can be an uncomfortable condition to deal with, however, the good news is you can overcome it with manual stretching over time.",
    "casuses": "Phimosis can be caused due to a variety of reasons, below is a list of some common causes. \n \n1. Wrong masturbation technique \n \n2. Fungal infection \n \n3. Using soap or antibacterials on glans or penis \n \n4. Foreskin not being stretched before during the early years of development and puberty. \n \n5. Short Frenulum. \n \n6. Medical conditions like BXO or Lichen Sclerosus \n \n7. Low insulin sensitivity or diabetes. \n \n8. Scarring due to forcible retraction during the early years of puberty. \n \nYou can find more detailed information regarding each cause in the article linked at the bottom of this page.",
    "image": "understanding-phimosis",
    "solutions": "1. Manual stretching \n2. Preputioplasty - the surgical opening of \n3. Full circumcision \n \nIt may be wise to avoid circumcision, as the loss of your foreskin may deprive you of sexual sensation. \n \nThis app focuses on helping you treat Phimosis using the manual stretching solution. However, it is always recommended that you seek medical advice from your doctor if you have any doubts. ",
    "goodNews": "Most cases of phimosis can be treated by manually stretching the foreskin. It can take from 1 month to 1 year depending on your starting point, however, you can cure the condition with consistent stretching workouts. \n \nFurthermore, it is important to understand you are not alone, many other men are dealing with the same issue, and many more have overcome it using manual stretching.",
    "references": [
    "Understanding the causes of phimosis article: \nhttps://www.phimostretch.com/blogs/news/what-causes-phimosis", "https://www.webmd.com/men/phimosis-paraphimosis#1", "https://www.healthline.com/health/mens-health/phimosis"]
}
