{
    "title": "Essential safety measures",
    "introduction": "The frenulum is a small band connecting your glans to the inner foreskin surface. Some men with phimosis often have a slightly shorter frenulum which can be stretched using the method shown.",
    "safetyTips": [
        {
            "title": "Use gentle pressure",
            "explanation": "The foreskin is sensitive so if you use too much pressure, it can tear and worsen the condition. Always ensure you use a light amount of pressure when performing any of the stretches. \n\nFurthermore, you should never feel pain whilst performing any of the stretches, you may, however, feel a slight uncomfortable sensation."
        },
        {
            "title": "Wash your hands before every exercise",
            "explanation": "Always clean your hands with soap before performing any stretches with your foreskin, otherwise, the bacteria on your hands may result in an infection; leading to more complications. "
        },
        {
            "title": "Avoid forcing the foreskin to retract",
            "explanation": "If your foreskin does not move behind the head, don’t force it back; this can cause the foreskin to get stuck behind the head. \n\nIf this occurs, you should go to the hospital immediately."
        },
        {
            "title": "Causing tears or cuts through overstretching",
            "explanation": "Do not over-stretch your skin, if you cause a tear or cut, it will be harmful to your progress. \n\nTherefore, always ensure you are gentle with your skin and consistent with the workouts, instead of attempting to force change quickly."
        },
        {
            "title": "Perform the stretches regularly",
            "explanation": "The more consistently you perform stretching workouts, the more flexible and loose your skin will become. \n\nIt is important to do these workouts at least once a day every day, so you should incorporate it into your daily routine."
        },
        {
            "title": "Take a break if the skin is irritated",
            "explanation": "You may accidentally overstretch your foreskin or damage it by stretching too forcefully. If this occurs, leave it alone for a couple of days so it can heal, then, start again. \n\nYou may notice puffy or thicker foreskin if you have overstretched."
        },
        {
            "title": "Be patient",
            "explanation": "Loosening the foreskin is not a quick process and it can be frustrating waiting for the results. But remember to be patient and perform the workouts consistently. \n\nNormally, you will start to see some changes after two weeks of daily stretching. \n\nDepending on the original state of the foreskin, it can take from one month to a year to cure phimosis. It is well worth the time though."
        },
        {
            "title": "Seek medical attention from a doctor",
            "explanation": "Seeing a doctor may be necessary if you have tight foreskin that you cannot loosen even after working through your stretches. \n\nDo not feel embarrassed about visiting a doctor as they will understand your issue and can recommend the fastest cure."
        },
    ],
    "image": "safety",
    "references": ["https://www.wikihow.fitness/Do-Phimosis-Stretching", "https://www.phimostretch.com/blogs/news/phimosis-stretching-guide"]
}
